using static System.Console;
Clear();

// 1. Ввод данных 
// 2. Обработка данных
// 3. Вывод данных

/* 
Программа которая на взод принимает число и выдает квадрат этого числа
4 = 16
-3 = 9
-7 = 49
Write("Введите число: ");
int num = Convert.ToInt32(ReadLine()!);
int num1 = num*num;
Write($"{num1}");
*/


// ===========================



/* Программа, которая на вход принимает два числа, и проверяет, является ли первое
число квадратом второго.
a = 5; b = 25; yes
a = 2; b = 10; no
a = 9; b = -3; no
*/

// принимаем на вход 2 числа

// Write("Введите первое число: ");
// int first_num = Convert.ToInt32(ReadLine()!);
// Write("Введите второе число: ");
// int second_num = Convert.ToInt32(ReadLine()!);

// if (first_num * first_num == second_num)
// {
//     Write($"Число {first_num} явлется квадраторм числа {second_num}");
// }
// else
// {
//     Write($"Число {first_num} не являетя квадратом 2-ого числа ");
// }


// ===========================


/* Программа, которая будет выдавать названия дня недели по заданному номеру */


/*
Write("Введите день недели: ");
int num = Convert.ToInt32(ReadLine()!);
if (num > 7 || num < 1)
{
    Write("Такой недели не существует");
}
if (num == 1)
{
    Write("Понедельник");
}
if (num == 2)
{
    Write("Вторник");
}
if (num == 3)
{
    Write("Среда");
}
if (num == 4)
{
    Write("Четверг");
}
if (num == 5)
{
    Write("Пятница");
}
if (num == 6)
{
    Write("Суббота");
}
if (num == 7)
{
    Write("Воскресенье");
}
*/


// ===========================



/* Программа, которая на вход принимает одно число N, а на выходе показывает все
целые числа в промежутке от -N до N. 
4 -> "-4,-3,-2,-1,0,1,2,3,4"
*/

// Write("Введите число: ");
// int num = Convert.ToInt32(ReadLine()!);
// int num1 = -num;

// while (num1 < num+1)
// {
//     Write($"{num1},");
//     num1++;
// }



// ===========================


/* Программа, котрая принимает на вход 3-х значное число,
и на выходе показывает последнюю цифру этого числа
*/

// Write("Введите 3-х значное число: ");
// int num = Convert.ToInt32(ReadLine()!);
// int num1 = num%10;

// WriteLine(num1);

// ===========================