using static System.Console;
Clear();



// Урок 4. Функции продолжение
// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) 
// и возводит число A в натуральную степень B.

// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// Write("Число А: ");
// int a = Convert.ToInt32(ReadLine()!);
// Write("Число Б: ");
// int b = Convert.ToInt32(ReadLine()!);
// int c = 1;

// while(b > 0)
// {
//     c = c*a;
//     b--;
// }
// Write(c);




// Задача 27: Напишите программу, которая принимает на вход число 
// и выдаёт сумму цифр в числе.

// 452 -> 11
// 82 -> 10
// 9012 -> 12

// int a = new Random().Next(10, 9999);
// WriteLine($"Получили рандомное число: {a}");

// int a1 = a/100/10; // Получили последнее число:
// int a2 = a/100%10; // Получили второе число:
// int a3 = a%100/10; // Получили третье число
// int a4 = a%10; // Получили последнее число

// int total = a1+a2+a3+a4;
// WriteLine(total);



// Задача 29: Напишите программу, которая задаёт массив из 8 элементов 
// и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]

