using static System.Console;
Clear();

// Программа которая принимает число и выдает его квадрат (число умноженное само на себя)

// Write("Введите число: ");
// int a = Convert.ToInt32(ReadLine()!);
// int b = a * a;
// WriteLine($"Результат: {b}");

// **************

// Программа принимает на вход 2 числа и проверяем, является ли первое число квадратом второго
// Пример: 
// а = 25 : в = 5: > да
// а = 2: в = 10 > нет

// Write("Введите первое число: ");
// int a1 = Convert.ToInt32(ReadLine()!);
// Write("Введите второе число: ");
// int a2 = Convert.ToInt32(ReadLine()!);

// if (a1 == a2 * a2)
// {
//     WriteLine($"{a1} является квадратом числа {a2}");
// }
// else
// {
//     WriteLine($"Число {a1} не является квадратом числа {a2}");
// }

// **************

// Программа будет выдавать название дня недели по цифре

// Write("Введите номер дня недели: ");
// int a = Convert.ToInt32(ReadLine()!);
// if (a >= 8 || a < 1)
// {
//     WriteLine($"{a} - Такого дня недели не существует.");
// }
// if (a == 1)
// {
//     WriteLine($"{a} - Понедельник!");
// }

// **************

// Програма принимает на вход число N, а на выходе показывает
// все целые число от -N to N

// Write("Укажите цисло: ");
// int a = Convert.ToInt32(ReadLine()!);
// int b = -a;
// WriteLine($"Проверяем что получилось: {a} и {b}");

// for (int i = a; b < i; b++)
// {
//    // if (b % 2 == 0)
//     Write($"{b},");
// }


// **************

// Принимаем на вход 3х-значное число, показываем последнюю цифру
// данного числа
// 567 - 7
// 439 - 9

// Write("Введите число: ");
// int a = Convert.ToInt32(ReadLine()!);
// int b = a % 10;
// WriteLine($"{b}");




