using static System.Console;
Clear();


// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Write("Введите число: ");
// int a = Convert.ToInt32(ReadLine()!);
// int a1 = a / 10 % 10;

// WriteLine(a1);




// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6


// Write("Введите число: ");
// int a = Convert.ToInt32(ReadLine()!);

// if (a < 100)
// {
//     WriteLine($"{a} - третьей цифры нет");
// }
// while (a > 1000)
// {
//     a = a/10;
// }
// WriteLine($"{a%10}");




// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, 
// является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> не


// Write("Проверим выходной ли день: ");
// int a = Convert.ToInt32(ReadLine()!);
// if (a >= 1 & a <= 5)
// {
//     WriteLine("будни");
// }
// if (a >= 6 & a <= 7)
// {
//     WriteLine("выходной");
// }
